{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_11", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 31, 200, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_7"}, "name": "input_7", "inbound_nodes": []}, {"class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dtype": "float32", "dims": [2, 1, 3]}, "name": "permute_1", "inbound_nodes": [[["input_7", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAGAAAAUwAAAHMcAAAAfABkAGQAhQJkAGQAhQJkAGQAZAGFA2YDGQBT\nACkCTun/////qQCpAdoBeHICAAAAcgIAAAD6TUM6L1VzZXJzL2FtbWFyL2FuYWNvbmRhMy9lbnZz\nL3RmanMvbGliL3NpdGUtcGFja2FnZXMva2VyYXNfb2NyL3JlY29nbml0aW9uLnB52gg8bGFtYmRh\nPtgAAADzAgAAABwA\n", null, null], "function_type": "lambda", "module": "keras_ocr.recognition", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_4", "inbound_nodes": [[["permute_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_1", "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_2", "inbound_nodes": [[["conv_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_3", "inbound_nodes": [[["conv_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn_3", "inbound_nodes": [[["conv_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "maxpool_3", "inbound_nodes": [[["bn_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_4", "inbound_nodes": [[["maxpool_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_5", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_5", "inbound_nodes": [[["conv_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn_5", "inbound_nodes": [[["conv_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "maxpool_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "maxpool_5", "inbound_nodes": [[["bn_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_6", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_6", "inbound_nodes": [[["maxpool_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_7", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_7", "inbound_nodes": [[["conv_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn_7", "inbound_nodes": [[["conv_7", 0, 0, {}]]]}, {"class_name": "Functional", "config": {"name": "model_9", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 7, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_8"}, "name": "input_8", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["input_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 6, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["input_8", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "name": "model_9", "inbound_nodes": [[["bn_7", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAC0AAAAIAAAAQwAAAHOwAwAAfAAvAn0BfQJ8AWoAZAFkAIUCGQB9A3QBoAB8\nAaEBZAIZAH0EdAGgAHwBoQFkARkAfQV0AaAAfAGhAWQDGQB9BnQBoAB8AaEBZAQZAH0HdAFqAnwC\nfARkA2QEZgNkBY0CfQJ0AaACfAJkBqECfQJ0AaADfAJkB6ECfQJ8A2QCGQB9CHwDZAEZAH0JdAR8\nCHwJgwJ9CnQBoAV8CmQCoQJ9CnQBoAJ8CmQIZwGhAn0KdAGgBnwKdAGgB3wEZwGhAaECfQp0AaAC\nfAp0AaAHfARkBGQIZwOhAaECfQp0AaAIfAJ8CqECfQt0AaAJfAtnAGQJogFnAGQKogGhA30MdAGg\nCXwLZwBkC6IBZwBkCqIBoQN9DXQBoAJ8DGQIZwGhAn0OdAGgAnwNZAhnAaECfQ90AWoDfAVkB2QM\njQJ9EHQBagN8BmQHZAyNAn0RfANkAhkAfQh8A2QBGQB9CXQBagN8DmQHZAyNAn0OdAFqA3wPZAdk\nDI0CfQ9kDXwOZA4XABQAfBEUAH0OZA18D2QOFwAUAHwQFAB9D3QBoAN0AaAKfA6hAWQPoQJ9EnwS\nZAEXAH0TdAGgA3QBoAp8D6EBZA+hAn0UfBRkARcAfRV0AWoDfAVkARgAZA9kDI0CfRZ0AWoDfAZk\nARgAZA9kDI0CfRd0AWoLZwBkD2QMjQJ9GHQBoAx8EnwYfBehA30SdAGgDHwTfBh8F6EDfRN0AaAM\nfBR8GHwWoQN9FHQBoAx8FXwYfBahA30VfAZ8BRQAfRl0AaANfAShAXwZFAB9GnwIfAkUAH0bdA58\nGnwbgwJ9HHwcfBR8BhQAFwB9HXwcfBV8BhQAFwB9HnwdfBIXAH0ffB58EhcAfSB8HXwTFwB9IXwe\nfBMXAH0idAFqAnwBZAh8B2YCZAWNAn0jdAFqA3wjZAdkDI0CfSN0AaAPfCN8H6ECfSR0AaAPfCN8\nIKECfSV0AaAPfCN8IaECfSZ0AaAPfCN8IqECfSd0AaADfBJkB6ECfRJ0AaADfBNkB6ECfRN0AaAD\nfBRkB6ECfRR0AaADfBVkB6ECfRV0AaAFfBN8DhgAfBV8DxgAFABkAaECfSh0AaAFfBN8DhgAfA98\nFBgAFABkAaECfSl0AaAFfA58EhgAfBV8DxgAFABkAaECfSp0AaAFfA58EhgAfA98FBgAFABkAaEC\nfSt0AaAQfCh8JBQAfCl8JRQAfCp8JhQAfCt8JxQAZwShAX0sdAFqAnwsfAR8CHwJfAdmBGQFjQJ9\nLHwsUwApEE7pAQAAAOkAAAAA6QIAAADpAwAAAKkB2gVzaGFwZSkD6f////9yAwAAAHIEAAAA2gdm\nbG9hdDMycgcAAAApA3ICAAAAcgIAAAByAgAAACkDcgcAAAByAQAAAHIHAAAAqQNyAgAAAHIBAAAA\ncgIAAACpAdoFZHR5cGVnAAAAAAAA4D/nAAAAAAAA8D/aBWludDMyKRFyBgAAANoCdGbaB3Jlc2hh\ncGXaBGNhc3TaCV9tZXNoZ3JpZNoLZXhwYW5kX2RpbXPaBHRpbGXaBXN0YWNr2gZtYXRtdWzaBXNs\naWNl2gVmbG9vctoFemVyb3PaDWNsaXBfYnlfdmFsdWXaBXJhbmdl2gdfcmVwZWF02gZnYXRoZXLa\nBWFkZF9uKS3aBmlucHV0c1oIbG9jbmV0X3jaCGxvY25ldF952gtvdXRwdXRfc2l6ZdoKYmF0Y2hf\nc2l6ZdoGaGVpZ2h02gV3aWR0aNoMbnVtX2NoYW5uZWxzWg1vdXRwdXRfaGVpZ2h02gxvdXRwdXRf\nd2lkdGjaDGluZGljZXNfZ3JpZFoQdHJhbnNmb3JtZWRfZ3JpZFoDeF9zWgN5X3PaAXjaAXlaDGhl\naWdodF9mbG9hdFoLd2lkdGhfZmxvYXTaAngw2gJ4MdoCeTDaAnkx2gVtYXhfedoFbWF4X3jaBHpl\ncm9aFWZsYXRfaW1hZ2VfZGltZW5zaW9uc1oMcGl4ZWxzX2JhdGNoWhZmbGF0X291dHB1dF9kaW1l\nbnNpb25z2gRiYXNlWgdiYXNlX3kwWgdiYXNlX3kxWglpbmRpY2VzX2FaCWluZGljZXNfYloJaW5k\naWNlc19jWglpbmRpY2VzX2TaCmZsYXRfaW1hZ2VaDnBpeGVsX3ZhbHVlc19hWg5waXhlbF92YWx1\nZXNfYloOcGl4ZWxfdmFsdWVzX2NaDnBpeGVsX3ZhbHVlc19kWgZhcmVhX2FaBmFyZWFfYloGYXJl\nYV9jWgZhcmVhX2RaEXRyYW5zZm9ybWVkX2ltYWdlqQByMgAAAPpNQzovVXNlcnMvYW1tYXIvYW5h\nY29uZGEzL2VudnMvdGZqcy9saWIvc2l0ZS1wYWNrYWdlcy9rZXJhc19vY3IvcmVjb2duaXRpb24u\ncHnaCl90cmFuc2Zvcm1JAAAAc5YAAAAIAQ4BDgEOAQ4BDgEUAgwCDAEIAggBCgEMAQ4BFAEYAQwC\nFgEWAQ4BDgEOAw4BCAIIAQ4CDgEQARABEgIIARIBCAESAhIBDgEOAg4BDgEOAQgCDgEIAQoBDAEM\nAQgBCAEIAQgBEgIOAQwBDAEMAQwBDAIMAQwBDAEYAhgBGAEYAQQBBgIGAQYBBgEC/AT/BAoMAQb/\nBAM=\n", null, null], "function_type": "lambda", "module": "keras_ocr.recognition", "output_shape": [50, 7, 512], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_5", "inbound_nodes": [[["bn_7", 0, 0, {}], ["model_9", 1, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": "float32", "target_shape": [50, 3584]}, "name": "reshape", "inbound_nodes": [[["lambda_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc_9", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc_9", "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_10", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_10", "inbound_nodes": [[["fc_9", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_10_back", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_10_back", "inbound_nodes": [[["fc_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["lstm_10", 0, 0, {}], ["lstm_10_back", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_11", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_11", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "lstm_11_back", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "recurrent_initializer": {"module": "keras.initializers", "class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm_11_back", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_9", "inbound_nodes": [[["lstm_11", 0, 0, {}], ["lstm_11_back", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "fc_12", "trainable": true, "dtype": "float32", "units": 37, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeNormal", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "fc_12", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_6", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAAAAAAEAAAAEAAAAEwAAAHMUAAAAfABkAGQAhQKIAGQAhQJmAhkAUwCpAU6pAKkB\n2gF4qQHaFHJubl9zdGVwc190b19kaXNjYXJkcgIAAAD6TUM6L1VzZXJzL2FtbWFyL2FuYWNvbmRh\nMy9lbnZzL3RmanMvbGliL3NpdGUtcGFja2FnZXMva2VyYXNfb2NyL3JlY29nbml0aW9uLnB52gg8\nbGFtYmRhPk4BAADzAgAAABQA\n", null, [2]], "function_type": "lambda", "module": "keras_ocr.recognition", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_6", "inbound_nodes": [[["fc_12", 0, 0, {}]]]}], "input_layers": [["input_7", 0, 0]], "output_layers": [["lambda_6", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "bn_3/gamma", "shape": [256], "dtype": "float32"}, {"name": "bn_3/beta", "shape": [256], "dtype": "float32"}, {"name": "bn_3/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bn_3/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "bn_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn_5/beta", "shape": [512], "dtype": "float32"}, {"name": "bn_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bn_7/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn_7/beta", "shape": [512], "dtype": "float32"}, {"name": "bn_7/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bn_7/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv_1/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "conv_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv_2/bias", "shape": [128], "dtype": "float32"}, {"name": "conv_3/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv_3/bias", "shape": [256], "dtype": "float32"}, {"name": "conv_4/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv_4/bias", "shape": [256], "dtype": "float32"}, {"name": "conv_5/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv_5/bias", "shape": [512], "dtype": "float32"}, {"name": "conv_6/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv_6/bias", "shape": [512], "dtype": "float32"}, {"name": "conv_7/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv_7/bias", "shape": [512], "dtype": "float32"}, {"name": "fc_12/kernel", "shape": [256, 37], "dtype": "float32"}, {"name": "fc_12/bias", "shape": [37], "dtype": "float32"}, {"name": "fc_9/kernel", "shape": [3584, 128], "dtype": "float32"}, {"name": "fc_9/bias", "shape": [128], "dtype": "float32"}, {"name": "lstm_10/lstm_cell/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_10/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_10/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_10_back/lstm_cell/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_10_back/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_10_back/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_11/lstm_cell/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_11/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_11/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "lstm_11_back/lstm_cell/kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_11_back/lstm_cell/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "lstm_11_back/lstm_cell/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [5, 5, 512, 16], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [16], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [5, 5, 16, 32], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [11200, 64], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [64, 6], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [6], "dtype": "float32"}]}]}